ones = {0: "", 1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
        7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одиннадцать",
        12: "двенадцать", 13: "тринадцать", 14: "четырнадцать", 15: "пятнадцать",
        16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"}
tens = ("", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят",
        "семьдесят", "восемьдесят", "девяносто")
hundreds = ("", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот",
            "восемьсот", "девятьсот")
other = ("", ("тысяча", "тысяч", "тысячи"), "миллион", "миллиард", "триллион", "квадриллион", "квинтиллион",
         "секстиллион", "септиллион", "октиллион", "нониллион", "дециллион", "андециллион", "дуодециллион"
         "тредециллион", "кваттордециллион", "квиндециллион", "сексдециллион",
         "септемдециллион", "октодецилион", "новемдециллион", "вигинтиллион", "анвигинтиллион",
         "дуовигинтиллион", "тревигинтиллион", "кватторвигинтиллион", "квинвигинтиллион",
         "сексвигинтиллион", "септемвигинтиллион", "октовигинтиллион",
         "новемвигинтиллион", "тригинтиллион", "антригинтиллион")
